In [1]:
import pandas as pd

In [ ]:
pip install pandas

In [ ]:
# Q1

In [23]:
d1 = pd.Series(data=(4 , 8 , 15 , 16 , 23 , 42) , name ='Numbers')
d1

0     4
1     8
2    15
3    16
4    23
5    42
Name: Numbers, dtype: int64

In [ ]:
# Q2

In [7]:
L = [1 , 2 , 3 , 4 , 5 , 6 , 7 , 8 , 9 , 10]

my_series=pd.Series(L)
my_series

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [ ]:
# Q3

In [6]:
data = {
    "Name" : ["Alice" ,"Bob" , "claire"],
    "Age": [25 , 30 , 27],
    "Gender": ["Female" , "Male" , "Female"]
}

df = pd.DataFrame.from_dict(data)

df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  claire   27  Female

In [ ]:
# Q4

In pandas, a DataFrame is a two-dimensional tabular data structure that resembles a spreadsheet or a SQL table. It is the primary data structure used for data manipulation and analysis in pandas. DataFrames are capable of holding heterogeneous data types, and they provide powerful indexing, slicing, reshaping, and aggregating functionalities, making them suitable for various data analysis tasks.

On the other hand, a pandas Series is a one-dimensional labeled array that can hold data of any type (integer, string, float, etc.). It is similar to a NumPy array but comes with an explicitly defined index that can be used to access elements. A Series is often considered as a single column of a DataFrame.

In [13]:
# Example :

#DataFrame
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  claire   27  Female

In [14]:
# Series
s = df["Name"]
print(type(s))
s

<class 'pandas.core.series.Series'>

0     Alice
1       Bob
2    claire
Name: Name, dtype: object

In [ ]:
# Q5

Pandas provides a wide range of functions to manipulate data in a DataFrame. Here are some common functions along with examples of when you might use them:

1) DataFrame.head(n): Returns the first n rows of the DataFrame.

2) DataFrame.describe(): Generates descriptive statistics of numerical columns in the DataFrame.

3) DataFrame.drop(columns): Removes specified columns from the DataFrame.

4) DataFrame.rename(columns): Renames columns in the DataFrame.

In [27]:
# Example : 
data1 = {
    'Name': ['John', 'Emma', 'Michael', 'Sophia', 'William'],
    'Age': [28, 24, 32, 27, 31],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix']
 }

df1 =  pd.DataFrame.from_dict(data1)
print(df1,"\n")

df1.describe()

      Name  Age         City
0     John   28     New York
1     Emma   24  Los Angeles
2  Michael   32      Chicago
3   Sophia   27      Houston
4  William   31      Phoenix

             Age
count   5.000000
mean   28.400000
std     3.209361
min    24.000000
25%    27.000000
50%    28.000000
75%    31.000000
max    32.000000

In [ ]:
# Q6

Of The Following Only DataFrame Is Mutable.

In [ ]:
# Q7

In [9]:
df2 = pd.DataFrame()
L1 = pd.Series( ['John', 'Emma', 'Michael', 'Sophia', 'William'])
L2 = pd.Series([28, 24, 32, 27, 31])
L3 = pd.Series( ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'])

df2["Name"] = L1
df2["Age"] = L2
df2["City"] = L3

df2

      Name  Age         City
0     John   28     New York
1     Emma   24  Los Angeles
2  Michael   32      Chicago
3   Sophia   27      Houston
4  William   31      Phoenix